<template>
  <html lang="en">
    <head>
      <meta charset="UTF-8" />
      <meta name="viewport" content="width=device-width, initial-scale=1.0" />
      <title>ProTaskサービスプライバシーポリシー</title>
    </head>
    <body>
      <h1>プライバシーポリシー</h1>
      <section class="article-box">
        <h2>ProTaskサービス・アプリ</h2>
        <h2>プライバシーポリシー</h2>
        <p>
          ProTask(以下、「本アプリ」という。）をご利用の皆様（以下「ユーザー」という）に関する個人情報を含んだ情報（以下「ユーザー情報」という）の取扱いについて、以下のとおりプライバシーポリシー（以下「本ポリシー」という）を定めます。
        </p>
        <article>
          <h2>1,取得するユーザー情報と目的</h2>
          <p>
            本アプリケーションで取得するユーザー情報と目的は以下のとおりです。
          </p>
          <p>（1）大学システム利用ID: 大学から各個人に配布されている文字列</p>
          <p>
            （2）大学システム利用パスワード：
            大学システム（教学web/Luna）を利用する際に登録する各個人の暗号
          </p>
          <p>
            ※なお、システム利用ID及びパスワードに関しては「暗号化されたシステム利用ID・パスワード」を使用しています
          </p>
          <p>目的：各個人が大学講義情報を本アプリ上で表示するため</p>
        </article>
        <article>
          <h2>2,取得方法</h2>
          <p>
            本アプリケーションで取得するユーザー情報の取得方法は以下のとおりです。
          </p>
          <p>
            本アプリは、情報収集モジュールを内蔵した本アプリケーションにより、ユーザー情報を自動取得します。
          </p>
        </article>
        <article>
          <h2>3,通知・公表または同意取得の方法・利用者関与の方法</h2>
          <p>
            （１）通知・公表
            本アプリは本ポリシーに関する通知・公表は本アプリケーションに掲載する方法で行います。
          </p>
          <p>
            （２）同意取得の方法
            同意の取得は、本アプリケーションの初回起動時に取得する方法で行います。
          </p>
        </article>
        <article>
          <h2>4,外部送信・第三者提供・情報収集モジュール</h2>
          <p>
            （１）外部送信
            取得したユーザー情報については、当社が管理を委託するホスティング会社のサーバーに送信されます。
          </p>

          <p></p>
          <p>
            （２）第三者提供
            当社は、取得したユーザー情報について、以下の場合第三者に提供することがあります。
            ・統計的なデータなどユーザーを識別することができない状態で提供する場合
            ・法令に基づき開示・提供を求められた場合
          </p>
          <p>
            （３）情報収集モジュール
            当社は、本アプリケーションに以下の情報収集モジュールを組み込みます。
            ・Chrome Node API :Puppeteer
          </p>
        </article>
        <article>
          <h2>お問い合わせ</h2>
          <p>
            当社のプライバシーポリシーに関する、ご意見、ご質問、苦情の申出その他ユーザー情報の取扱いに関するお問い合わせは、以下の窓口にご連絡ください。
            「問い合わせ窓口」はこちら
          </p>
        </article>
        <article>
          <h2>7,改定</h2>
          <p>
            当社は、当社の裁量に基づいて、本ポリシーを変更します。但し、取得するユーザー情報、利用目的、第三者提供に変更が発生した場合、本アプリケーションまたは当社のホームページで通知するとともに、本ポリシー変更後、本アプリケーションの初回起動時に改めてユーザーから同意を取得します。
          </p>
        </article>
        <article>
          <h2>制定日・改定日</h2>
          <p>制定：2021年3月1日</p>
          <p>改定：2022年3月1日</p>
        </article>
      </section>
    </body>
  </html>
</template>
<script>
export default {
  layout: 'contract',
}
</script>
